# Occupation

### Introduction:

Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

### Step 1. Import the necessary libraries

In [77]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

### Step 3. Assign it to a variable called users.

In [78]:
users = pd.read_csv("https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user",sep="|")
users.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

### Step 4. Discover what is the mean age per occupation

In [79]:
users.groupby("occupation")["age"].mean()

occupation
administrator    38.746835
artist           31.392857
doctor           43.571429
educator         42.010526
engineer         36.388060
entertainment    29.222222
executive        38.718750
healthcare       41.562500
homemaker        32.571429
lawyer           36.750000
librarian        40.000000
marketing        37.615385
none             26.555556
other            34.523810
programmer       33.121212
retired          63.071429
salesman         35.666667
scientist        35.548387
student          22.081633
technician       33.148148
writer           36.311111
Name: age, dtype: float64

### Step 5. Discover the Male ratio per occupation and sort it from the most to the least

In [80]:
users = users.assign(is_male=lambda x: x.gender == "M")
users

     user_id  age gender     occupation zip_code  is_male
0          1   24      M     technician    85711     True
1          2   53      F          other    94043    False
2          3   23      M         writer    32067     True
3          4   24      M     technician    43537     True
4          5   33      F          other    15213    False
..       ...  ...    ...            ...      ...      ...
938      939   26      F        student    33319    False
939      940   32      M  administrator    02215     True
940      941   20      M        student    97229     True
941      942   48      F      librarian    78209    False
942      943   22      M        student    77841     True

[943 rows x 6 columns]

In [81]:
males_per_occ = users.groupby("occupation")["is_male"].sum() / users.occupation.value_counts() *  100
males_per_occ.sort_values(ascending=False)

occupation
doctor           100.000000
engineer          97.014925
technician        96.296296
retired           92.857143
programmer        90.909091
executive         90.625000
scientist         90.322581
entertainment     88.888889
lawyer            83.333333
salesman          75.000000
educator          72.631579
student           69.387755
other             65.714286
marketing         61.538462
writer            57.777778
none              55.555556
administrator     54.430380
artist            53.571429
librarian         43.137255
healthcare        31.250000
homemaker         14.285714
dtype: float64

### Step 6. For each occupation, calculate the minimum and maximum ages

In [82]:
users.groupby("occupation")[["age"]].agg(["min","max"])

              age
              min max
occupation
administrator  21  70
artist         19  48
doctor         28  64
educator       23  63
engineer       22  70
entertainment  15  50
executive      22  69
healthcare     22  62
homemaker      20  50
lawyer         21  53
librarian      23  69
marketing      24  55
none           11  55
other          13  64
programmer     20  63
retired        51  73
salesman       18  66
scientist      23  55
student         7  42
technician     21  55
writer         18  60

### Step 7. For each combination of occupation and gender, calculate the mean age

In [83]:
users.groupby(["occupation","gender"])[["age"]].mean()

                            age
occupation    gender
administrator F       40.638889
              M       37.162791
artist        F       30.307692
              M       32.333333
doctor        M       43.571429
educator      F       39.115385
              M       43.101449
engineer      F       29.500000
              M       36.600000
entertainment F       31.000000
              M       29.000000
executive     F       44.000000
              M       38.172414
healthcare    F       39.818182
              M       45.400000
homemaker     F       34.166667
              M       23.000000
lawyer        F       39.500000
              M       36.200000
librarian     F       40.000000
              M       40.000000
marketing     F       37.200000
              M       37.875000
none          F       36.500000
              M       18.600000
other         F       35.472222
              M       34.028986
programmer    F       32.166667
              M       33.216667
retired       F       70.000000
              M       62.538462
salesman      F       27.000000
              M       38.555556
scientist     F       28.333333
              M       36.321429
student       F       20.750000
              M       22.669118
technician    F       38.000000
              M       32.961538
writer        F       37.631579
              M       35.346154

### Step 8.  For each occupation present the percentage of women and men

In [84]:
gender_count= users.groupby(["occupation","gender"]).agg(gender_count=pd.NamedAgg(column="gender", aggfunc=lambda x: x.count()))
result = gender_count.unstack()
result.columns = result.columns.droplevel(0) 
total = result["F"].fillna(0) + result["M"].fillna(0)
result.assign(f_ratio=result["F"] * 100 / total, m_ratio=result["M"] * 100 / total)

gender            F      M    f_ratio     m_ratio
occupation
administrator  36.0   43.0  45.569620   54.430380
artist         13.0   15.0  46.428571   53.571429
doctor          NaN    7.0        NaN  100.000000
educator       26.0   69.0  27.368421   72.631579
engineer        2.0   65.0   2.985075   97.014925
entertainment   2.0   16.0  11.111111   88.888889
executive       3.0   29.0   9.375000   90.625000
healthcare     11.0    5.0  68.750000   31.250000
homemaker       6.0    1.0  85.714286   14.285714
lawyer          2.0   10.0  16.666667   83.333333
librarian      29.0   22.0  56.862745   43.137255
marketing      10.0   16.0  38.461538   61.538462
none            4.0    5.0  44.444444   55.555556
other          36.0   69.0  34.285714   65.714286
programmer      6.0   60.0   9.090909   90.909091
retired         1.0   13.0   7.142857   92.857143
salesman        3.0    9.0  25.000000   75.000000
scientist       3.0   28.0   9.677419   90.322581
student        60.0  136.0  30.612245   69.387755
technician      1.0   26.0   3.703704   96.296296
writer         19.0   26.0  42.222222   57.777778

In [ ]:
# create a data frame and apply count to gender
gender_ocup = users.groupby(['occupation', 'gender']).agg({'gender': 'count'})

# create a DataFrame and apply count for each occupation
occup_count = users.groupby(['occupation']).agg('count')

# divide the gender_ocup per the occup_count and multiply per 100
occup_gender = gender_ocup.div(occup_count, level = "occupation") * 100

# present all rows from the 'gender column'
occup_gender.loc[: , 'gender']

                      age      gender  is_male  user_id  zip_code
occupation    gender
administrator F       NaN   45.569620      NaN      NaN       NaN
              M       NaN   54.430380      NaN      NaN       NaN
artist        F       NaN   46.428571      NaN      NaN       NaN
              M       NaN   53.571429      NaN      NaN       NaN
doctor        M       NaN  100.000000      NaN      NaN       NaN
educator      F       NaN   27.368421      NaN      NaN       NaN
              M       NaN   72.631579      NaN      NaN       NaN
engineer      F       NaN    2.985075      NaN      NaN       NaN
              M       NaN   97.014925      NaN      NaN       NaN
entertainment F       NaN   11.111111      NaN      NaN       NaN
              M       NaN   88.888889      NaN      NaN       NaN
executive     F       NaN    9.375000      NaN      NaN       NaN
              M       NaN   90.625000      NaN      NaN       NaN
healthcare    F       NaN   68.750000      NaN      NaN       NaN
              M       NaN   31.250000      NaN      NaN       NaN
homemaker     F       NaN   85.714286      NaN      NaN       NaN
              M       NaN   14.285714      NaN      NaN       NaN
lawyer        F       NaN   16.666667      NaN      NaN       NaN
              M       NaN   83.333333      NaN      NaN       NaN
librarian     F       NaN   56.862745      NaN      NaN       NaN
              M       NaN   43.137255      NaN      NaN       NaN
marketing     F       NaN   38.461538      NaN      NaN       NaN
              M       NaN   61.538462      NaN      NaN       NaN
none          F       NaN   44.444444      NaN      NaN       NaN
              M       NaN   55.555556      NaN      NaN       NaN
other         F       NaN   34.285714      NaN      NaN       NaN
              M       NaN   65.714286      NaN      NaN       NaN
programmer    F       NaN    9.090909      NaN      NaN       NaN
              M       NaN   90.909091      NaN      NaN       NaN
retired       F       NaN    7.142857      NaN      NaN       NaN
              M       NaN   92.857143      NaN      NaN       NaN
salesman      F       NaN   25.000000      NaN      NaN       NaN
              M       NaN   75.000000      NaN      NaN       NaN
scientist     F       NaN    9.677419      NaN      NaN       NaN
              M       NaN   90.322581      NaN      NaN       NaN
student       F       NaN   30.612245      NaN      NaN       NaN
              M       NaN   69.387755      NaN      NaN       NaN
technician    F       NaN    3.703704      NaN      NaN       NaN
              M       NaN   96.296296      NaN      NaN       NaN
writer        F       NaN   42.222222      NaN      NaN       NaN
              M       NaN   57.777778      NaN      NaN       NaN